app/controllers/codes_controller.rb

SELECT * FROM "codes" LIMIT 1
---
    lon = params[:lon]
    lat = params[:lat]
    num = 0.08333
    @crop = Code.first(:conditions => ["crop_name = ? AND (lat - #{num}) < ? AND (lat + #{num}) > ? AND (lon - #{num}) < ? AND (lon + #{num}) > ?", crop_name, lat, lat, lon, lon])